# در این تمرین، شما باید یک تابع به نام sum_numbers(*args) تعریف کنید که بتواند هر تعداد عدد را دریافت کرده و مجموع آن‌ها را برگرداند.
#
# وظیفه شما:
# یک تابع به نام sum_numbers(*args) بنویسید که:تعداد نامحدودی از اعداد را به عنوان ورودی دریافت کند.
# مجموع این اعداد را محاسبه کرده و برگرداند (return).
# اگر هیچ عددی ارسال نشود، مقدار 0 را برگرداند.
#
# ورودی‌ها:
# صفر یا چندین عدد صحیح که به تابع sum_numbers ارسال می‌شوند.
#
# خروجی‌ها:
# عددی که نشان‌دهنده مجموع تمام ورودی‌ها باشد.
# اگر هیچ ورودی‌ای ارسال نشود، مقدار 0 برگردانده شود.

def sum_numbers(*num):
    if num == 0:
        return 0
    res = 0
    for i in num:
        res += i
    return res


print(sum_numbers())