# یک جادوگر تصمیم گرفته است که با استفاده از یک طلسم خاص،
# قدرت اعداد را افزایش دهد! او یک عدد n را انتخاب می‌کند و سپس برای n مرحله، کارهای زیر را انجام می‌دهد:
#
# اگر عدد فرد باشد، مقدار آن را دو برابر کرده و 1 واحد کم می‌کند.
# اگر عدد زوج باشد، مقدار آن را نصف می‌کند.
# جادوگر این عملیات را دقیقاً n بار انجام می‌دهد.
# 📝 ورودی:
#
# عدد صحیح n که تعداد مراحل را مشخص می‌کند (1 ≤ n ≤ 20).
# عدد صحیح x که مقدار اولیه است (1 ≤ x ≤ 1000).
# 📤 خروجی:
#
# در انتها مقدار نهایی x را نمایش بده.

x = int(input("enter your number : "))
n = int(input("enter number of steps : "))

for _ in range(0, n):
    if x % 2 != 0:
        x *= 2
        x -= 1
    else:
        x /= 2

print("Magic number :", x)
