# یک ماشین به نام «ماشین جادویی» داریم که یک عدد اولیه n را می‌گیرد و می‌خواهد به 1 برسد. ماشین می‌تواند دو کار انجام دهد:
#
# اگر عدد فعلی بر ۲ بخش‌پذیر باشد، آن را نصف می‌کند.
# اگر عدد فعلی بر ۲ بخش‌پذیر نباشد، عدد را ضربدر ۳ کرده و ۱ را به آن اضافه می‌کند.
# وظیفه شما این است که برنامه‌ای بنویسید که عدد اولیه n را از ورودی دریافت کرده و نشان دهید که چگونه ماشین به 1 می‌رسد.
#
# ورودی:
#
# یک عدد صحیح n (۲ ≤ n ≤ ۱۰۰۰)
#
# خروجی:
#
# در هر مرحله، مقدار فعلی عدد n را چاپ کنید تا وقتی که عدد به ۱ برسد.


n = int(input("enter a number between 2 and 1000 : "))

myP = [n]
print(n)
while n > 1:
    if n % 2 == 0:
        n //= 2
    else:
        n *= 3
        n += 1
    myP.append(n)
    print(n)

jadi_result = [50, 25, 76, 38, 19, 58, 29, 88, 44, 22, 11, 34, 17, 52, 26, 13, 40, 20, 10, 5, 16, 8, 4, 2, 1]

print(myP)
print(jadi_result)
print(myP == jadi_result)
